src/InformationRegisters/ИС_Ozon_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураOzon</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ИС_Озон_Сервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 20.03.25 УА #96356
Функция ОбработатьУцененныеТовары(Профиль, Таблица) Экспорт
	
	НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура("Номенклатура", NULL));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Таблица;
	КонецЕсли;
	
	МассивSKU = Таблица.ВыгрузитьКолонку("SKU");
	МассивSKU = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивSKU);
	МассивSKU = ИС_МП_Сервер.УдалитьПустыеЭлементыМассива(МассивSKU);
	
	SKUТоваров = SKUТоваровПоУцененнымSKU(Профиль, МассивSKU);
	
	Если SKUТоваров = Неопределено Тогда
		Возврат Таблица;
	КонецЕсли;
	
	Если SKUТоваров.Количество() = 0 Тогда
		Возврат Таблица;	
	КонецЕсли;
	
	ТЧ = Новый ТаблицаЗначений;
	
	ТЧ.Колонки.Добавить("SKU", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	Для Каждого Строка Из НайденныеСтроки Цикл 
		
		Если SKUТоваров[Строка.SKU] <> Неопределено Тогда
			Строка.SKU = SKUТоваров[Строка.SKU];	
			НоваяСтрока = ТЧ.Добавить();
			НоваяСтрока.SKU = Строка.SKU;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Таблица.SKU КАК SKU
	|ПОМЕСТИТЬ ВТ_Таблица
	|ИЗ
	|	&Таблица КАК ВТ_Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Таблица.SKU КАК SKU,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ЕдиницаИзмерения = ИС_Ozon_СоответствиеХарактеристик.Упаковка
	|			ТОГДА &ПустаяУпаковка
	|		ИНАЧЕ ИС_Ozon_СоответствиеХарактеристик.Упаковка
	|	КОНЕЦ КАК Упаковка
	|ИЗ
	|	ВТ_Таблица КАК ВТ_Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль = &Профиль)
	|			И (ВТ_Таблица.SKU = СТРОКА(ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku))";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Таблица", ТЧ);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаSKU = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаSKU.Следующий() Цикл
		
		НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура("SKU", ВыборкаSKU.SKU));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], ВыборкаSKU);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Таблица;

КонецФункции //- ИнфоСофт Ивонин К.А. 20.03.25 УА #96356

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 20.03.25 УА #96356
Функция SKUТоваровПоУцененнымSKU(Профиль, МассивSKU)
	
	Попытка
		НастройкиСоединения = ИС_Ozon_Сервер.ПолучитьНастройкиСоединенияПрофиля(Профиль);
		ПараметрыЗапроса = ИС_Ozon_Сервер.ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
		
	СоответствиеУцененныхSKU = Новый Соответствие;
	
	МассивДляЗапроса = ИС_МП_Сервер.РазбитьМассивПоNЭлементов(МассивSKU, 500);
	
	КоличествоОшибок = 0;
	
	Для Каждого Элемент Из МассивДляЗапроса Цикл
		
		РезультатSKU = ИС_Ozon_API.ИнформацияОбУценкеИОсновномТовареПоSKU(Профиль, ПараметрыЗапроса, Элемент);	
		
		Если РезультатSKU = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;	
		КонецЕсли;
		
		Если РезультатSKU.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЭлементSKU Из РезультатSKU Цикл
			
			Если СоответствиеУцененныхSKU[Строка(ЭлементSKU.discounted_sku)] = Неопределено Тогда
				СоответствиеУцененныхSKU.Вставить(Строка(ЭлементSKU.discounted_sku), Строка(ЭлементSKU.sku));	
			Иначе
				СоответствиеУцененныхSKU[Строка(ЭлементSKU.discounted_sku)] = Строка(ЭлементSKU.sku);
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоОшибок > 10 Тогда
			Возврат Неопределено;	
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат СоответствиеУцененныхSKU;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.03.25 УА #96356

#КонецОбласти
